const DEFAULT_PRESET_COLOR = { r: 255, g: 165, b: 0, a: 0.5 };

export const allExercises = [
  {
    category: "Ноги",
    exercises: [
      "Приседания",
      "Жим ногами",
      "Выпады",
      "Болгарские выпады",
      "Разгибания ног в тренажере",
      "Сгибания ног в тренажере",
    ],
  },
  {
    category: "Ягодицы",
    exercises: [
      "Ягодичный мост",
      "Румынская тяга",
      "Отведение ноги в кроссовере",
      "Гиперэкстензия",
    ],
  },
  {
    category: "Спина",
    exercises: [
      "Подтягивания",
      "Тяга верхнего блока",
      "Тяга штанги в наклоне",
      "Тяга горизонтального блока",
      "Тяга гантели одной рукой",
    ],
  },
  {
    category: "Грудь",
    exercises: [
      "Жим лежа",
      "Жим гантелей на наклонной скамье",
      "Разведение гантелей лежа",
      "Отжимания на брусьях",
      "Сведение рук в кроссовере",
    ],
  },
  {
    category: "Плечи",
    exercises: [
      "Армейский жим",
      "Махи в сторону",
      "Махи в наклоне",
      "Тяга штанги к подбородку",
    ],
  },
  {
    category: "Руки",
    exercises: [
      "Подъём гантелей на бицепс",
      "Молотки",
      "Разгибания на блоке",
      "Французский жим",
      "Подъём штанги на бицепс",
    ],
  },
  {
    category: "Пресс",
    exercises: [
      "Скручивания",
      "Планка",
      "Подъем ног в висе",
      "Русский твист",
    ],
  },
  {
    category: "Кардио",
    exercises: [
      "Бег",
      "Велотренажер",
      "Гребной тренажер",
      "Эллиптический тренажер",
      "Скакалка",
    ],
  },
  {
    category: "Икры",
    exercises: [
      "Подъемы на носки стоя",
      "Подъемы на носки сидя",
      "Подъемы на носки в тренажере",
    ],
  },
  {
    category: "Предплечья",
    exercises: [
      "Сгибания кистей с гантелями",
      "Разгибания кистей с гантелями",
      "Фермерская прогулка",
    ],
  },
  {
    category: "Мобильность",
    exercises: [
      "Растяжка задней поверхности бедра",
      "Растяжка грудных мышц",
      "Мобилизация грудного отдела",
    ],
  },
];

export const trainingPreset = [
  {
    presetName: "Грудь и бицепс",
    exercises: [
      "Жим лежа",
      "Жим гантелей на наклонной скамье",
      "Подъём гантелей на бицепс",
      "Молотки",
    ],
    presetColor: DEFAULT_PRESET_COLOR,
  },
  {
    presetName: "Спина и трицепс",
    exercises: [
      "Подтягивания",
      "Тяга верхнего блока",
      "Тяга штанги в наклоне",
      "Разгибания на блоке",
    ],
    presetColor: DEFAULT_PRESET_COLOR,
  },
  {
    presetName: "Ноги и плечи",
    exercises: [
      "Приседания",
      "Жим ногами",
      "Выпады",
      "Армейский жим",
      "Махи в сторону",
    ],
    presetColor: DEFAULT_PRESET_COLOR,
  },
  {
    presetName: "Фулбоди для новичка",
    exercises: [
      "Приседания",
      "Жим лежа",
      "Тяга верхнего блока",
      "Планка",
      "Велотренажер",
    ],
    presetColor: DEFAULT_PRESET_COLOR,
  },
  {
    presetName: "Кардио и кор",
    exercises: ["Бег", "Гребной тренажер", "Скручивания", "Планка"],
    presetColor: DEFAULT_PRESET_COLOR,
  },
  {
    presetName: "Спина и бицепс",
    exercises: [
      "Подтягивания",
      "Тяга горизонтального блока",
      "Тяга гантели одной рукой",
      "Подъём штанги на бицепс",
      "Молотки",
    ],
    presetColor: DEFAULT_PRESET_COLOR,
  },
  {
    presetName: "Ягодицы и ноги",
    exercises: [
      "Ягодичный мост",
      "Румынская тяга",
      "Болгарские выпады",
      "Жим ногами",
      "Подъемы на носки стоя",
    ],
    presetColor: DEFAULT_PRESET_COLOR,
  },
  {
    presetName: "Плечи и трицепс",
    exercises: [
      "Армейский жим",
      "Махи в сторону",
      "Махи в наклоне",
      "Разгибания на блоке",
      "Французский жим",
    ],
    presetColor: DEFAULT_PRESET_COLOR,
  },
  {
    presetName: "Легкая восстановительная",
    exercises: [
      "Эллиптический тренажер",
      "Планка",
      "Растяжка задней поверхности бедра",
      "Растяжка грудных мышц",
      "Мобилизация грудного отдела",
    ],
    presetColor: DEFAULT_PRESET_COLOR,
  },
];
